###########
# tooling #
###########

tap 'homebrew/cask'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'git'
brew 'stow'
brew 'rg'
brew 'jq'
brew 'tig'
brew 'watch'

tap 'justwatchcom/gopass'
brew 'gopass'
brew 'pinentry-mac'

############
# blogging #
############

brew 'hugo'

###############
# programming #
###############

# apple
mas 'XCode', id: 497799835

# jvm
cask 'java' unless system '/usr/libexec/java_home --failfast'
tap 'homebrew/cask-versions'
cask 'adoptopenjdk8'
cask 'intellij-idea-ce'
brew 'gradle'
brew 'leiningen'
brew 'maven'

# .net
brew 'mono'
brew 'azure-cli'
cask 'visual-studio-code'
cask 'visual-studio'
tap 'samritchie/forge'
brew 'forge'

# .node
brew 'node'

# python
brew 'python3'

# ruby
brew 'rbenv'
brew 'ruby-build'

# go
brew 'go'
brew 'dep'

# misc
cask 'docker'
cask 'vagrant'
cask 'virtualbox'
brew 'reattach-to-user-namespace'
cask 'emacs'

############
# browsers #
############

cask 'firefox'
cask 'google-chrome'

###########
# storage #
###########

cask 'dropbox'
cask 'box-sync'

########
# apps #
########

cask 'calibre'
cask 'skype'
cask 'zoomus'
cask 'spotify'
cask 'deezer'
cask 'xquartz'
cask 'flux'
cask 'authy'
cask 'discord'
cask 'caffeine'
cask 'airtable'
mas 'Slack', id: 803453959
mas 'Magnet', id: 441258766
mas 'Pocket', id: 568494494
mas 'Twitter', id: 409789998
mas 'Evernote', id: 406056744
mas 'The Unarchiver', id: 425424353

##########
# gaming #
##########

cask 'steam'
cask 'gog-galaxy'

#########
# fonts #
#########
tap 'homebrew/cask-fonts'
cask 'font-open-sans'

#######
# Ops #
#######

brew 'kops'
brew 'minikube'
brew 'awscli'
brew 'terraform'
brew 'cfssl'
brew 'vault'
brew 'aws-iam-authenticator'
brew 'kubectx'
