###########
# tooling #
###########

brew 'vim'
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'stow'
brew 'rg'
brew 'jq'
brew 'tig'
brew 'watch'
brew 'direnv'
brew 'starship'
brew 'nushell'
brew 'fuzzy-find'
brew 'pinentry-mac'
brew 'coreutils'

###############
# programming #
###############

# apple
mas 'XCode', id: 497799835

# jvm
cask 'temurin' unless system '/usr/libexec/java_home --failfast'
cask 'temurin@21'

# .node
brew 'node'

# python
brew 'python3'

# ruby
brew 'rbenv'
brew 'ruby-build'

brew 'golang'

# misc
brew 'docker'
brew 'docker-compose'
brew 'colima'
cask 'visual-studio-code'
cask 'ghostty'

############
# browsers #
############
cask 'firefox'
cask 'google-chrome'

###########
# storage #
###########
cask 'dropbox'
cask 'box-sync'
cask 'proton-drive'

########
# apps #
########
cask 'meetingbar'
cask 'zoom'
cask 'microsoft-teams'
cask 'flux-app'
cask 'authy'
cask 'discord'
cask 'caffeine'
cask 'alfred'
mas 'Magnet', id: 441258766
mas 'Pocket', id: 568494494
mas 'The Unarchiver', id: 425424353
mas 'Proton Authenticator', id: 6741758667

##########
# gaming #
##########
cask 'steam'

#########
# fsonts #
#########
cask 'font-open-sans'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

#########
# music #
#########

##########
# proton #
##########
cask 'proton-pass'
cask 'protonvpn'
cask 'proton-mail'

