tap 'anomalyco/tap'

###########
# tooling #
###########

brew 'vim'
brew 'git'
brew 'rg'
brew 'jq'
brew 'watch'
brew 'direnv'
brew 'fuzzy-find'
brew 'gnupg'
brew 'pinentry-mac'
brew 'coreutils'
cask 'ghostty'
brew 'starship'
brew 'nushell'
brew 'tmux'

###############
# programming #
###############

# apple
mas 'XCode', id: 497799835

# jvm
cask 'temurin' unless system '/usr/libexec/java_home --failfast'
cask 'temurin@25'

# .node
brew 'node'

# python
brew 'python3'

# ruby
brew 'rbenv'
brew 'ruby-build'

# golang
brew 'golang'

# apple dev
brew 'xcode-build-server'
brew 'xcbeautify'
brew 'swiftformat'

# docker
brew 'docker'
brew 'docker-compose'
brew 'colima'

############
# browsers #
############
cask 'firefox'
cask 'google-chrome'

###########
# storage #
###########
cask 'proton-drive'

########
# apps #
########
cask 'flux-app'
cask 'discord'
cask 'caffeine'
cask 'alfred'
mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353

##########
# gaming #
##########
cask 'steam'

#########
# fsonts #
#########
cask 'font-open-sans'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

#########
# music #
#########

##########
# proton #
##########
cask 'proton-pass'
cask 'protonvpn'
cask 'proton-mail'

###########
# editors #
###########
cask 'visual-studio-code'
cask 'antigravity'
cask 'cursor'

######
# ai #
######
cask 'claude'
cask 'block-goose'
brew 'block-goose-cli'
cask 'claude-code'
brew 'anomalyco/tap/opencode'
cask 'cursor-cli'
cask 'kiro'
cask 'kiro-cli'

##########
# design #
##########
cask 'figma'

#######
# dev #
#######
brew 'gh'
